In [4]:
import pandas as pd
import numpy as np

In [5]:
authors = pd.DataFrame({'author_id': [1, 2, 3], 
                        'author_name': ['Тургенев', 'Чехов', 'Островский']}, columns=['author_id','author_name'])

In [6]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [7]:
book =  pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 
                        'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
                     'price':[450, 300, 350, 500, 450, 370, 290]}, columns = ['author_id','book_title','price'])

In [8]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [14]:
authors_price = pd.merge (authors, book, on = 'author_id', how = 'outer' )

In [15]:
 top5 = authors_price.nlargest(5, 'price')

In [32]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [60]:
max_price = authors_price.groupby('author_name').agg({'price':'max'})
min_price = authors_price.groupby('author_name').agg({'price':'min'}) 
mean_price = authors_price.groupby('author_name').agg({'price':'mean'})

In [54]:
authors_stat_m = pd.merge (max_price, min_price,  on = 'author_name', how = 'left' )

In [55]:
authors_stat = pd.merge (authors_stat_m, mean_price, on = 'author_name', how = 'outer' )

In [64]:
authors_stat = authors_stat.reset_index()
authors_stat = authors_stat.rename(columns={'price_x':'max_price'})
authors_stat

   index author_name  max_price  price_y       price
0      0  Островский        370      290  330.000000
1      1    Тургенев        450      300  366.666667
2      2       Чехов        500      450  475.000000

In [65]:
authors_stat = authors_stat.reset_index()
authors_stat = authors_stat.rename(columns={'price_y':'min_price'})
authors_stat

   level_0  index author_name  max_price  min_price       price
0        0      0  Островский        370        290  330.000000
1        1      1    Тургенев        450        300  366.666667
2        2      2       Чехов        500        450  475.000000